; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p11---int100n150-m25---int100c200---s311---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level9 level9)
(sum level0 level10 level10)
(sum level0 level14 level14)
(sum level0 level19 level19)
(sum level0 level22 level22)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level9 level10)
(sum level1 level10 level11)
(sum level1 level14 level15)
(sum level1 level19 level20)
(sum level1 level22 level23)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level9 level11)
(sum level2 level10 level12)
(sum level2 level14 level16)
(sum level2 level19 level21)
(sum level2 level22 level24)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level9 level12)
(sum level3 level10 level13)
(sum level3 level14 level17)
(sum level3 level19 level22)
(sum level3 level22 level25)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level9 level13)
(sum level4 level10 level14)
(sum level4 level14 level18)
(sum level4 level19 level23)
(sum level4 level22 level26)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level9 level14)
(sum level5 level10 level15)
(sum level5 level14 level19)
(sum level5 level19 level24)
(sum level5 level22 level27)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level9 level15)
(sum level6 level10 level16)
(sum level6 level14 level20)
(sum level6 level19 level25)
(sum level6 level22 level28)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level9 level16)
(sum level7 level10 level17)
(sum level7 level14 level21)
(sum level7 level19 level26)
(sum level7 level22 level29)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level9 level17)
(sum level8 level10 level18)
(sum level8 level14 level22)
(sum level8 level19 level27)
(sum level8 level22 level30)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level9 level18)
(sum level9 level10 level19)
(sum level9 level14 level23)
(sum level9 level19 level28)
(sum level9 level22 level31)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level9 level19)
(sum level10 level10 level20)
(sum level10 level14 level24)
(sum level10 level19 level29)
(sum level10 level22 level32)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level9 level20)
(sum level11 level10 level21)
(sum level11 level14 level25)
(sum level11 level19 level30)
(sum level11 level22 level33)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level9 level21)
(sum level12 level10 level22)
(sum level12 level14 level26)
(sum level12 level19 level31)
(sum level12 level22 level34)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level9 level22)
(sum level13 level10 level23)
(sum level13 level14 level27)
(sum level13 level19 level32)
(sum level13 level22 level35)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level9 level23)
(sum level14 level10 level24)
(sum level14 level14 level28)
(sum level14 level19 level33)
(sum level14 level22 level36)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level9 level24)
(sum level15 level10 level25)
(sum level15 level14 level29)
(sum level15 level19 level34)
(sum level15 level22 level37)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level9 level25)
(sum level16 level10 level26)
(sum level16 level14 level30)
(sum level16 level19 level35)
(sum level16 level22 level38)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level9 level26)
(sum level17 level10 level27)
(sum level17 level14 level31)
(sum level17 level19 level36)
(sum level17 level22 level39)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level9 level27)
(sum level18 level10 level28)
(sum level18 level14 level32)
(sum level18 level19 level37)
(sum level18 level22 level40)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level9 level28)
(sum level19 level10 level29)
(sum level19 level14 level33)
(sum level19 level19 level38)
(sum level19 level22 level41)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level9 level29)
(sum level20 level10 level30)
(sum level20 level14 level34)
(sum level20 level19 level39)
(sum level20 level22 level42)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level9 level30)
(sum level21 level10 level31)
(sum level21 level14 level35)
(sum level21 level19 level40)
(sum level21 level22 level43)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level9 level31)
(sum level22 level10 level32)
(sum level22 level14 level36)
(sum level22 level19 level41)
(sum level22 level22 level44)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level9 level32)
(sum level23 level10 level33)
(sum level23 level14 level37)
(sum level23 level19 level42)
(sum level23 level22 level45)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level9 level33)
(sum level24 level10 level34)
(sum level24 level14 level38)
(sum level24 level19 level43)
(sum level24 level22 level46)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level9 level34)
(sum level25 level10 level35)
(sum level25 level14 level39)
(sum level25 level19 level44)
(sum level25 level22 level47)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level9 level35)
(sum level26 level10 level36)
(sum level26 level14 level40)
(sum level26 level19 level45)
(sum level26 level22 level48)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level9 level36)
(sum level27 level10 level37)
(sum level27 level14 level41)
(sum level27 level19 level46)
(sum level27 level22 level49)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level9 level37)
(sum level28 level10 level38)
(sum level28 level14 level42)
(sum level28 level19 level47)
(sum level28 level22 level50)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level9 level38)
(sum level29 level10 level39)
(sum level29 level14 level43)
(sum level29 level19 level48)
(sum level29 level22 level51)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level9 level39)
(sum level30 level10 level40)
(sum level30 level14 level44)
(sum level30 level19 level49)
(sum level30 level22 level52)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level9 level40)
(sum level31 level10 level41)
(sum level31 level14 level45)
(sum level31 level19 level50)
(sum level31 level22 level53)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level9 level41)
(sum level32 level10 level42)
(sum level32 level14 level46)
(sum level32 level19 level51)
(sum level32 level22 level54)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level9 level42)
(sum level33 level10 level43)
(sum level33 level14 level47)
(sum level33 level19 level52)
(sum level33 level22 level55)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level9 level43)
(sum level34 level10 level44)
(sum level34 level14 level48)
(sum level34 level19 level53)
(sum level34 level22 level56)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level9 level44)
(sum level35 level10 level45)
(sum level35 level14 level49)
(sum level35 level19 level54)
(sum level35 level22 level57)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level9 level45)
(sum level36 level10 level46)
(sum level36 level14 level50)
(sum level36 level19 level55)
(sum level36 level22 level58)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level9 level46)
(sum level37 level10 level47)
(sum level37 level14 level51)
(sum level37 level19 level56)
(sum level37 level22 level59)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level9 level47)
(sum level38 level10 level48)
(sum level38 level14 level52)
(sum level38 level19 level57)
(sum level38 level22 level60)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level9 level48)
(sum level39 level10 level49)
(sum level39 level14 level53)
(sum level39 level19 level58)
(sum level39 level22 level61)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level9 level49)
(sum level40 level10 level50)
(sum level40 level14 level54)
(sum level40 level19 level59)
(sum level40 level22 level62)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level9 level50)
(sum level41 level10 level51)
(sum level41 level14 level55)
(sum level41 level19 level60)
(sum level41 level22 level63)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level9 level51)
(sum level42 level10 level52)
(sum level42 level14 level56)
(sum level42 level19 level61)
(sum level42 level22 level64)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level9 level52)
(sum level43 level10 level53)
(sum level43 level14 level57)
(sum level43 level19 level62)
(sum level43 level22 level65)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level9 level53)
(sum level44 level10 level54)
(sum level44 level14 level58)
(sum level44 level19 level63)
(sum level44 level22 level66)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level9 level54)
(sum level45 level10 level55)
(sum level45 level14 level59)
(sum level45 level19 level64)
(sum level45 level22 level67)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level9 level55)
(sum level46 level10 level56)
(sum level46 level14 level60)
(sum level46 level19 level65)
(sum level46 level22 level68)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level9 level56)
(sum level47 level10 level57)
(sum level47 level14 level61)
(sum level47 level19 level66)
(sum level47 level22 level69)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level9 level57)
(sum level48 level10 level58)
(sum level48 level14 level62)
(sum level48 level19 level67)
(sum level48 level22 level70)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level9 level58)
(sum level49 level10 level59)
(sum level49 level14 level63)
(sum level49 level19 level68)
(sum level49 level22 level71)
(sum level49 level25 level74)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level9 level59)
(sum level50 level10 level60)
(sum level50 level14 level64)
(sum level50 level19 level69)
(sum level50 level22 level72)
(sum level50 level25 level75)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level9 level60)
(sum level51 level10 level61)
(sum level51 level14 level65)
(sum level51 level19 level70)
(sum level51 level22 level73)
(sum level51 level25 level76)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level9 level61)
(sum level52 level10 level62)
(sum level52 level14 level66)
(sum level52 level19 level71)
(sum level52 level22 level74)
(sum level52 level25 level77)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level9 level62)
(sum level53 level10 level63)
(sum level53 level14 level67)
(sum level53 level19 level72)
(sum level53 level22 level75)
(sum level53 level25 level78)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level9 level63)
(sum level54 level10 level64)
(sum level54 level14 level68)
(sum level54 level19 level73)
(sum level54 level22 level76)
(sum level54 level25 level79)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level9 level64)
(sum level55 level10 level65)
(sum level55 level14 level69)
(sum level55 level19 level74)
(sum level55 level22 level77)
(sum level55 level25 level80)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level9 level65)
(sum level56 level10 level66)
(sum level56 level14 level70)
(sum level56 level19 level75)
(sum level56 level22 level78)
(sum level56 level25 level81)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level57 level9 level66)
(sum level57 level10 level67)
(sum level57 level14 level71)
(sum level57 level19 level76)
(sum level57 level22 level79)
(sum level57 level25 level82)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level58 level9 level67)
(sum level58 level10 level68)
(sum level58 level14 level72)
(sum level58 level19 level77)
(sum level58 level22 level80)
(sum level58 level25 level83)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level59 level9 level68)
(sum level59 level10 level69)
(sum level59 level14 level73)
(sum level59 level19 level78)
(sum level59 level22 level81)
(sum level59 level25 level84)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level60 level9 level69)
(sum level60 level10 level70)
(sum level60 level14 level74)
(sum level60 level19 level79)
(sum level60 level22 level82)
(sum level60 level25 level85)
(sum level61 level1 level62)
(sum level61 level2 level63)
(sum level61 level5 level66)
(sum level61 level6 level67)
(sum level61 level9 level70)
(sum level61 level10 level71)
(sum level61 level14 level75)
(sum level61 level19 level80)
(sum level61 level22 level83)
(sum level61 level25 level86)
(sum level62 level1 level63)
(sum level62 level2 level64)
(sum level62 level5 level67)
(sum level62 level6 level68)
(sum level62 level9 level71)
(sum level62 level10 level72)
(sum level62 level14 level76)
(sum level62 level19 level81)
(sum level62 level22 level84)
(sum level62 level25 level87)
(sum level63 level1 level64)
(sum level63 level2 level65)
(sum level63 level5 level68)
(sum level63 level6 level69)
(sum level63 level9 level72)
(sum level63 level10 level73)
(sum level63 level14 level77)
(sum level63 level19 level82)
(sum level63 level22 level85)
(sum level63 level25 level88)
(sum level64 level1 level65)
(sum level64 level2 level66)
(sum level64 level5 level69)
(sum level64 level6 level70)
(sum level64 level9 level73)
(sum level64 level10 level74)
(sum level64 level14 level78)
(sum level64 level19 level83)
(sum level64 level22 level86)
(sum level64 level25 level89)
(sum level65 level1 level66)
(sum level65 level2 level67)
(sum level65 level5 level70)
(sum level65 level6 level71)
(sum level65 level9 level74)
(sum level65 level10 level75)
(sum level65 level14 level79)
(sum level65 level19 level84)
(sum level65 level22 level87)
(sum level65 level25 level90)
(sum level66 level1 level67)
(sum level66 level2 level68)
(sum level66 level5 level71)
(sum level66 level6 level72)
(sum level66 level9 level75)
(sum level66 level10 level76)
(sum level66 level14 level80)
(sum level66 level19 level85)
(sum level66 level22 level88)
(sum level67 level1 level68)
(sum level67 level2 level69)
(sum level67 level5 level72)
(sum level67 level6 level73)
(sum level67 level9 level76)
(sum level67 level10 level77)
(sum level67 level14 level81)
(sum level67 level19 level86)
(sum level67 level22 level89)
(sum level68 level1 level69)
(sum level68 level2 level70)
(sum level68 level5 level73)
(sum level68 level6 level74)
(sum level68 level9 level77)
(sum level68 level10 level78)
(sum level68 level14 level82)
(sum level68 level19 level87)
(sum level68 level22 level90)
(sum level69 level1 level70)
(sum level69 level2 level71)
(sum level69 level5 level74)
(sum level69 level6 level75)
(sum level69 level9 level78)
(sum level69 level10 level79)
(sum level69 level14 level83)
(sum level69 level19 level88)
(sum level70 level1 level71)
(sum level70 level2 level72)
(sum level70 level5 level75)
(sum level70 level6 level76)
(sum level70 level9 level79)
(sum level70 level10 level80)
(sum level70 level14 level84)
(sum level70 level19 level89)
(sum level71 level1 level72)
(sum level71 level2 level73)
(sum level71 level5 level76)
(sum level71 level6 level77)
(sum level71 level9 level80)
(sum level71 level10 level81)
(sum level71 level14 level85)
(sum level71 level19 level90)
(sum level72 level1 level73)
(sum level72 level2 level74)
(sum level72 level5 level77)
(sum level72 level6 level78)
(sum level72 level9 level81)
(sum level72 level10 level82)
(sum level72 level14 level86)
(sum level73 level1 level74)
(sum level73 level2 level75)
(sum level73 level5 level78)
(sum level73 level6 level79)
(sum level73 level9 level82)
(sum level73 level10 level83)
(sum level73 level14 level87)
(sum level74 level1 level75)
(sum level74 level2 level76)
(sum level74 level5 level79)
(sum level74 level6 level80)
(sum level74 level9 level83)
(sum level74 level10 level84)
(sum level74 level14 level88)
(sum level75 level1 level76)
(sum level75 level2 level77)
(sum level75 level5 level80)
(sum level75 level6 level81)
(sum level75 level9 level84)
(sum level75 level10 level85)
(sum level75 level14 level89)
(sum level76 level1 level77)
(sum level76 level2 level78)
(sum level76 level5 level81)
(sum level76 level6 level82)
(sum level76 level9 level85)
(sum level76 level10 level86)
(sum level76 level14 level90)
(sum level77 level1 level78)
(sum level77 level2 level79)
(sum level77 level5 level82)
(sum level77 level6 level83)
(sum level77 level9 level86)
(sum level77 level10 level87)
(sum level78 level1 level79)
(sum level78 level2 level80)
(sum level78 level5 level83)
(sum level78 level6 level84)
(sum level78 level9 level87)
(sum level78 level10 level88)
(sum level79 level1 level80)
(sum level79 level2 level81)
(sum level79 level5 level84)
(sum level79 level6 level85)
(sum level79 level9 level88)
(sum level79 level10 level89)
(sum level80 level1 level81)
(sum level80 level2 level82)
(sum level80 level5 level85)
(sum level80 level6 level86)
(sum level80 level9 level89)
(sum level80 level10 level90)
(sum level81 level1 level82)
(sum level81 level2 level83)
(sum level81 level5 level86)
(sum level81 level6 level87)
(sum level81 level9 level90)
(sum level82 level1 level83)
(sum level82 level2 level84)
(sum level82 level5 level87)
(sum level82 level6 level88)
(sum level83 level1 level84)
(sum level83 level2 level85)
(sum level83 level5 level88)
(sum level83 level6 level89)
(sum level84 level1 level85)
(sum level84 level2 level86)
(sum level84 level5 level89)
(sum level84 level6 level90)
(sum level85 level1 level86)
(sum level85 level2 level87)
(sum level85 level5 level90)
(sum level86 level1 level87)
(sum level86 level2 level88)
(sum level87 level1 level88)
(sum level87 level2 level89)
(sum level88 level1 level89)
(sum level88 level2 level90)
(sum level89 level1 level90)

(connected l0 l4)
(fuelcost level19 l0 l4)
(connected l0 l6)
(fuelcost level2 l0 l6)
(connected l1 l2)
(fuelcost level5 l1 l2)
(connected l1 l5)
(fuelcost level1 l1 l5)
(connected l2 l1)
(fuelcost level5 l2 l1)
(connected l2 l3)
(fuelcost level9 l2 l3)
(connected l2 l6)
(fuelcost level22 l2 l6)
(connected l3 l2)
(fuelcost level9 l3 l2)
(connected l3 l4)
(fuelcost level6 l3 l4)
(connected l3 l5)
(fuelcost level14 l3 l5)
(connected l4 l0)
(fuelcost level19 l4 l0)
(connected l4 l3)
(fuelcost level6 l4 l3)
(connected l4 l6)
(fuelcost level25 l4 l6)
(connected l5 l1)
(fuelcost level1 l5 l1)
(connected l5 l3)
(fuelcost level14 l5 l3)
(connected l5 l6)
(fuelcost level10 l5 l6)
(connected l6 l0)
(fuelcost level2 l6 l0)
(connected l6 l2)
(fuelcost level22 l6 l2)
(connected l6 l4)
(fuelcost level25 l6 l4)
(connected l6 l5)
(fuelcost level10 l6 l5)

(at t0 l6)
(fuel t0 level90)
(= (total-cost) 0)

(at p0 l2)
(at p1 l0)
(at p2 l2)
(at p3 l0)
(at p4 l0)
(at p5 l1)
(at p6 l0)
(at p7 l6)
(at p8 l2)
(at p9 l6)
(at p10 l3)
)

(:goal
(and
(at p0 l1)
(at p1 l6)
(at p2 l3)
(at p3 l6)
(at p4 l6)
(at p5 l2)
(at p6 l1)
(at p7 l0)
(at p8 l1)
(at p9 l4)
(at p10 l4)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l6)
   deleted: (at p7 l6)
   added: (in p7 t0)
   goals met: 0 of 11
2. (drive t0 l6 l0 level88 level2 level90)
   deleted: (at t0 l6) (fuel t0 level90)
   added: (at t0 l0) (fuel t0 level88)
   goals met: 0 of 11
3. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 1 of 11
4. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 1 of 11
5. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 1 of 11
6. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 1 of 11
7. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 1 of 11
8. (drive t0 l0 l6 level86 level2 level88)
   deleted: (at t0 l0) (fuel t0 level88)
   added: (at t0 l6) (fuel t0 level86)
   goals met: 1 of 11
9. (unload p4 t0 l6)
   deleted: (in p4 t0)
   added: (at p4 l6)
   goals met: 2 of 11
10. (unload p3 t0 l6)
   deleted: (in p3 t0)
   added: (at p3 l6)
   goals met: 3 of 11
11. (unload p1 t0 l6)
   deleted: (in p1 t0)
   added: (at p1 l6)
   goals met: 4 of 11
12. (load p9 t0 l6)
   deleted: (at p9 l6)
   added: (in p9 t0)
   goals met: 4 of 11
13. (drive t0 l6 l2 level64 level22 level86)
   deleted: (at t0 l6) (fuel t0 level86)
   added: (at t0 l2) (fuel t0 level64)
   goals met: 4 of 11
14. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 4 of 11
15. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 4 of 11
16. (drive t0 l2 l1 level59 level5 level64)
   deleted: (at t0 l2) (fuel t0 level64)
   added: (at t0 l1) (fuel t0 level59)
   goals met: 4 of 11
17. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 4 of 11
18. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 5 of 11
19. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 6 of 11
20. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 7 of 11
21. (drive t0 l1 l2 level54 level5 level59)
   deleted: (at t0 l1) (fuel t0 level59)
   added: (at t0 l2) (fuel t0 level54)
   goals met: 7 of 11
22. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 7 of 11
23. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 8 of 11
24. (drive t0 l2 l3 level45 level9 level54)
   deleted: (at t0 l2) (fuel t0 level54)
   added: (at t0 l3) (fuel t0 level45)
   goals met: 8 of 11
25. (load p10 t0 l3)
   deleted: (at p10 l3)
   added: (in p10 t0)
   goals met: 8 of 11
26. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 9 of 11
27. (drive t0 l3 l4 level39 level6 level45)
   deleted: (at t0 l3) (fuel t0 level45)
   added: (at t0 l4) (fuel t0 level39)
   goals met: 9 of 11
28. (unload p10 t0 l4)
   deleted: (in p10 t0)
   added: (at p10 l4)
   goals met: 10 of 11
29. (unload p9 t0 l4)
   deleted: (in p9 t0)
   added: (at p9 l4)
   goals met: 11 of 11
